/* Error message when an error was sent by racoonctl */
"An error occurred while connecting. See logs for more details." = "An error occurred while connecting. See logs for more details.";

/* Dialog message when helper tool need to be installed */
"An helper tool is needed to execute priviledged operations." = "An helper tool is needed to execute priviledged operations.";

/* Cancel button */
"Cancel" = "Cancel";

/* Title for dialog asking certificate password */
"Certificate is password portected" = "Certificate is password portected";

/* Message for succesful connection */
"Connected with IP %@." = "Connected with IP %@.";

/* Message de connexion au VPN */
"Connecting to VPN..." = "Connecting to VPN...";

/* Message for connection timeout */
"Connection timeout. See logs for more details." = "Connection timeout. See logs for more details.";

/* Button label to acknowledge closing */
"Disconnect and close" = "Disconnect and close";

/* Disconnected but an error may have occurred */
"Disconnected (but...)" = "Disconnected (but...)";

/* Disconnected message */
"Disconnected." = "Disconnected.";

/* Disconnection in progress */
"Disconnecting..." = "Disconnecting...";

/* Button label for doing nothing */
"Do nothing" = "Do nothing";

/* Button label to dismiss closing */
"Don't close" = "Don't close";

/* Dialog title when helper tool is disabled */
"Helper tool disabled" = "Helper tool disabled";

/* Dialog title when a generic error happened with helper tool */
"Helper tool failed" = "Helper tool failed";

/* Dialog title when helper tool need to be installed */
"Helper tool needed" = "Helper tool needed";

/* Dialog title when helper tool needs to be updated */
"Helper tool needs to be updated" = "Helper tool needs to be updated";

/* Dialog title when helper tool is partially installed */
"Helper tool partially installed" = "Helper tool partially installed";

/* Status message when starting VPN */
"Initializing VPN..." = "Initializing VPN...";

/* Button label to install helper tool */
"Install the helper tool" = "Install the helper tool";

/* Title for dialog when the certificate has been installed */
"New certificate installed" = "New certificate installed";

/* Message displayed when not able to find the list of VPN */
"No list of VPN found." = "No list of VPN found.";

/* Status message when not connected */
"Not connected." = "Not connected.";

/* OK button */
"OK" = "OK";

/* Button label to reinstall helper tool */
"Reinstall the helper tool" = "Reinstall the helper tool";

/* Button label for repairing helper tool */
"Repair the helper tool" = "Repair the helper tool";

/* Incomplete certificate */
"The certificate is incomplete and is missing certificate, private key or CA certificate." = "The certificate is incomplete and is missing certificate, private key or CA certificate.";

/* Message displayed when the connections has broken */
"The connection has been unexpectedly terminated. See logs for more details." = "The connection has been unexpectedly terminated. See logs for more details.";

/* Error message for 'Peer failed phase 1 authentication' */
"The first phase has failed. This may be a certificate problem." = "The first phase has failed. This may be a certificate problem.";

/* Dialog message when a generic error happened with helper tool */
"The helper tool needed to execute priviledged operations did not succeed. Please, look at the logs to find possible causes." = "The helper tool needed to execute priviledged operations did not succeed. Please, look at the logs to find possible causes.";

/* Dialog message when helper tool needs to be updated */
"The helper tool needed to execute priviledged operations needs to be updated." = "The helper tool needed to execute priviledged operations needs to be updated.";

/* Dialog message when helper tool is disabled */
"The helper tool needed to execute priviledged operations seems to have been disabled." = "The helper tool needed to execute priviledged operations seems to have been disabled.";

/* Dialog message when helper tool is partially installed */
"The helper tool needed to execute priviledged operations seems to have been partially installed." = "The helper tool needed to execute priviledged operations seems to have been partially installed.";

/* Message for dialog when the certificate has been installed */
"The provided certificate was correctly installed and will be used from now on." = "The provided certificate was correctly installed and will be used from now on.";

/* Error message for 'Peer failed phase 1 initiation */
"The remote end did not agree with the security parameters." = "The remote end did not agree with the security parameters.";

/* Error message for 'Peer not responsing' */
"The remote end did not answer our sollicitations." = "The remote end did not answer our sollicitations.";

/* Dialog message when trying to close while VPN is connected */
"The VPN is still active. Closing the application will disconnect it." = "The VPN is still active. Closing the application will disconnect it.";

/* Message for dialog asking certificate password */
"This certificate is password protected. Please, provide the password:" = "This certificate is password protected. Please, provide the password";

/* Prefix for error from racoonctl */
"Unable to connect to the VPN. %@" = "Unable to connect to the VPN. %@";

/* Generic error message from racoonctl */
"Unable to connect to the VPN. We got this error: %@" = "Unable to connect to the VPN. We got this error: %@";

/* Title for dialog when we are unable to convert P12 certificate */
"Unable to convert certificate" = "Unable to convert certificate";

/* Unable to parse P12 certificate */
"Unable to parse certificate: %s. You need a PKCS#12 certificate." = "Unable to parse certificate: %s. You need a PKCS#12 certificate.";

/* Message displayed when racoon.conf generation failed */
"Unable to prepare configuration. See logs for more details." = "Unable to prepare configuration. See logs for more details.";

/* Message when racoonctl was not invoked correctly */
"Unable to request VPN creation. See logs for more details." = "Unable to request VPN creation. See logs for more details.";

/* Message when racoon was not invoked correctly */
"Unable to start racoon daemon. See logs for more details." = "Unable to start racoon daemon. See logs for more details.";

/* Error message when unable to write certificate */
"Unable to write new certificate: %m." = "Unable to write new certificate: %m.";

/* Button label to update the helper tool */
"Update" = "Update";

/* Dialog title when trying to close while VPN is connected */
"VPN is still active" = "VPN is still active";

/* Unable to open certificate file */
"We are unable to open %@." = "We are unable to open %@.";

/* Error message for 'Xauth exchange failed' */
"Your credentials are incorrect or you don't have right to connect to this system." = "Your credentials are incorrect or you don't have right to connect to this system.";

/* Right descriptions */
"You must be authorized to start or stop IPsec daemon." = "You must be authorized to start or stop IPsec daemon.";
"You must be authorized to invoke IPsec control program." = "You must be authorized to invoke IPsec control program.";
